In [1]:
import pandas as pd

Task 1

In [2]:
# 1.1: Creating a DataFrame 
data=pd.DataFrame({
    "Name":["Aman","Saurav","Karan","Shubham","Abhishek",None,"Sameer"],
    "Age":[22,23,None,22,25,24,26],
    "Marks":[85,None,88,90,56,72,None],
    "Subject":["Math","Physics","Math","Chemistry","Math","Physics","Chemistry"]
    })

data

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
1    Saurav  23.0    NaN    Physics
2     Karan   NaN   88.0       Math
3   Shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math
5       NaN  24.0   72.0    Physics
6    Sameer  26.0    NaN  Chemistry

In [3]:
# 1.2: Check the shape of the dataset
#      Display the data types of the columns
#      Generate a statistical summary(mean/min/max)

print(data.shape,"\n")
print(data.dtypes,"\n")
data.describe()

(7, 4)

Name           str
Age        float64
Marks      float64
Subject        str
dtype: object

             Age      Marks
count   6.000000   5.000000
mean   23.666667  78.200000
std     1.632993  14.254824
min    22.000000  56.000000
25%    22.250000  72.000000
50%    23.500000  85.000000
75%    24.750000  88.000000
max    26.000000  90.000000

Task 2

In [4]:
#      Create a view showing only the "Name" and "Marks" columns
#      Select students who scored more than 80 marks
#      Select students older than 22 who also scored more than 80 marks
#      Count how many are enrolled in each subject

data[["Name", "Marks"]]

       Name  Marks
0      Aman   85.0
1    Saurav    NaN
2     Karan   88.0
3   Shubham   90.0
4  Abhishek   56.0
5       NaN   72.0
6    Sameer    NaN

In [5]:
data[data["Marks"] > 80]

      Name   Age  Marks    Subject
0     Aman  22.0   85.0       Math
2    Karan   NaN   88.0       Math
3  Shubham  22.0   90.0  Chemistry

In [6]:
data[(data["Age"] >= 22) & (data["Marks"] > 80)]

      Name   Age  Marks    Subject
0     Aman  22.0   85.0       Math
3  Shubham  22.0   90.0  Chemistry

In [7]:
data["Subject"].value_counts()

Subject
Math         3
Physics      2
Chemistry    2
Name: count, dtype: int64

Task 3

In [8]:
#      Sort the dataframe by "Marks" in descending order
#      Use a Specific Pandas function to find the top 2 highest scorers(Scholarship Candidates) without socrfing the whole dataframe
#      Identify the student with the lowest marks 
data_sorted = data.sort_values(by="Marks", ascending=False)
top_2_scorers = data_sorted.head(2)
top_2_scorers

      Name   Age  Marks    Subject
3  Shubham  22.0   90.0  Chemistry
2    Karan   NaN   88.0       Math

In [9]:
lowest_marks_student = data_sorted.tail(1)
lowest_marks_student

     Name   Age  Marks    Subject
6  Sameer  26.0    NaN  Chemistry

Task 4

In [10]:
#      Calculate the total number of missing values in each column
#      Filter and display the rows where "Marks" are missing
#      Create a new dataframe called cleaned df by removing any row that contains even a single missing value
#      Compare the shape of cleaned df vs original df

# count missing values per column
missing_counts = data.isna().sum()
print("Missing values per column:\n", missing_counts)

# rows where Marks is missing
marks_missing = data[data["Marks"].isna()]
marks_missing

# drop any row with at least one NaN
cleaned_df = data.dropna()

print("Original shape:", data.shape)
print("Cleaned shape:", cleaned_df.shape)

cleaned_df

Missing values per column:
 Name       1
Age        1
Marks      2
Subject    0
dtype: int64
Original shape: (7, 4)
Cleaned shape: (3, 4)

       Name   Age  Marks    Subject
0      Aman  22.0   85.0       Math
3   Shubham  22.0   90.0  Chemistry
4  Abhishek  25.0   56.0       Math

Task 5

In [11]:
# Look at the 'Marks' column in your output. Why are the values floats(eg.85.0) instead of integers?
# What is the risk of using inplace=True when dropping missing values?
# Based on the data, what specific feedback should u give to the admin team regarding the "Name" column?

In [ ]:
### Answers to Task 5 Questions

# - **Why are `Marks` values floats?**  Because the column contains `NaN` values, pandas uses a floating-point dtype to accommodate both integers and missing values. When the missing entries are dropped or filled, you could convert to an integer type, but the default numeric type for mixed integer/NaN data is `float`.

# - **Risk of using `inplace=True` when dropping missing values:**  Using `inplace=True` modifies the original `DataFrame` directly. This can lead to loss of the original data if you later realize you needed the unmodified version, and it makes debugging or reverting changes harder. It's safer to assign the result to a new variable (like `cleaned_df`) or reassign explicitly to the same name.

# - **Feedback for the admin team about the `Name` column:**  There is at least one missing name (`None`/`NaN`) in the dataset. The admin team should ensure a valid name is provided for every student and prevent records with missing names from being entered.